In [1]:
import numpy as np
import pandas as pd

## TH1

In [2]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [3]:
df2 = pd.DataFrame({
    'hoten': ['ltd', 'nve'],
    'gioitinh': ['nam', 'nữ']
})
df2

  hoten gioitinh
0   ltd      nam
1   nve       nữ

In [5]:
# kết hợp df1 và df2 theo cột (thêm dòng)
df_new1 = pd.concat([df1, df2], axis=0, ignore_index=True)
df_new1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ
3   ltd      nam
4   nve       nữ

## TH2

In [6]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [7]:
df2 = pd.DataFrame({
    'hoten': ['ltd', 'nve'],
    'gioitinh': ['nam', 'nữ'],
    'dienthoai': ['0903222444', '0908111222']
})
df2

  hoten gioitinh   dienthoai
0   ltd      nam  0903222444
1   nve       nữ  0908111222

In [8]:
# kết hợp df1 và df2 theo cột (thêm dòng)
df_new2 = pd.concat([df1, df2], axis=0, ignore_index=True)
df_new2

  hoten gioitinh   dienthoai
0   nva      nam         NaN
1   nvb      nam         NaN
2   ltc       nữ         NaN
3   ltd      nam  0903222444
4   nve       nữ  0908111222

## TH3

In [9]:
df1 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc'],
    'gioitinh': ['nam', 'nam', 'nữ']
})
df1

  hoten gioitinh
0   nva      nam
1   nvb      nam
2   ltc       nữ

In [15]:
df2 = pd.DataFrame({
    'hoten': ['nva', 'nvb', 'ltc', 'lte'],
    'dienthoai': ['0903222111', np.nan, '0903333444', '0918111222']
})
df2

  hoten   dienthoai
0   nva  0903222111
1   nvb         NaN
2   ltc  0903333444
3   lte  0918111222

In [16]:
# kết hợp df1 và df2 theo dòng (thêm cột)
df_new3 = pd.concat([df1, df2], axis=1)
df_new3

  hoten gioitinh hoten   dienthoai
0   nva      nam   nva  0903222111
1   nvb      nam   nvb         NaN
2   ltc       nữ   ltc  0903333444
3   NaN      NaN   lte  0918111222